GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.h
// Register: SPI2INTF
#define SPI2INTF SPI2INTF
extern volatile unsigned char           SPI2INTF            __at(0x097);
#ifndef _LIB_BUILD
asm("SPI2INTF equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIF                  :1;
        unsigned RXOIF                  :1;
        unsigned                        :1;
        unsigned EOSIF                  :1;
        unsigned SOSIF                  :1;
        unsigned TCZIF                  :1;
        unsigned SRMTIF                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI2TXUIF              :1;
        unsigned SPI2RXOIF              :1;
        unsigned                        :1;
        unsigned SPI2EOSIF              :1;
        unsigned SPI2SOSIF              :1;
        unsigned SPI2TCZIF              :1;
        unsigned SPI2SRMTIF             :1;
    };
} SPI2INTFbits_t;
extern volatile SPI2INTFbits_t SPI2INTFbits __at(0x097);
// bitfield macros
#define _SPI2INTF_TXUIF_POSN                                0x1
#define _SPI2INTF_TXUIF_POSITION                            0x1
#define _SPI2INTF_TXUIF_SIZE                                0x1
#define _SPI2INTF_TXUIF_LENGTH                              0x1
#define _SPI2INTF_TXUIF_MASK                                0x2
#define _SPI2INTF_RXOIF_POSN                                0x2
#define _SPI2INTF_RXOIF_POSITION                            0x2
#define _SPI2INTF_RXOIF_SIZE                                0x1
#define _SPI2INTF_RXOIF_LENGTH                              0x1
#define _SPI2INTF_RXOIF_MASK                                0x4
#define _SPI2INTF_EOSIF_POSN                                0x4
#define _SPI2INTF_EOSIF_POSITION                            0x4
#define _SPI2INTF_EOSIF_SIZE                                0x1
#define _SPI2INTF_EOSIF_LENGTH                              0x1
#define _SPI2INTF_EOSIF_MASK                                0x10
#define _SPI2INTF_SOSIF_POSN                                0x5
#define _SPI2INTF_SOSIF_POSITION                            0x5
#define _SPI2INTF_SOSIF_SIZE                                0x1
#define _SPI2INTF_SOSIF_LENGTH                              0x1
#define _SPI2INTF_SOSIF_MASK                                0x20
#define _SPI2INTF_TCZIF_POSN                                0x6
#define _SPI2INTF_TCZIF_POSITION                            0x6
#define _SPI2INTF_TCZIF_SIZE                                0x1
#define _SPI2INTF_TCZIF_LENGTH                              0x1
#define _SPI2INTF_TCZIF_MASK                                0x40
#define _SPI2INTF_SRMTIF_POSN                               0x7
#define _SPI2INTF_SRMTIF_POSITION                           0x7
#define _SPI2INTF_SRMTIF_SIZE                               0x1
#define _SPI2INTF_SRMTIF_LENGTH                             0x1
#define _SPI2INTF_SRMTIF_MASK                               0x80
#define _SPI2INTF_SPI2TXUIF_POSN                            0x1
#define _SPI2INTF_SPI2TXUIF_POSITION                        0x1
#define _SPI2INTF_SPI2TXUIF_SIZE                            0x1
#define _SPI2INTF_SPI2TXUIF_LENGTH                          0x1
#define _SPI2INTF_SPI2TXUIF_MASK                            0x2
#define _SPI2INTF_SPI2RXOIF_POSN                            0x2
#define _SPI2INTF_SPI2RXOIF_POSITION                        0x2
#define _SPI2INTF_SPI2RXOIF_SIZE                            0x1
#define _SPI2INTF_SPI2RXOIF_LENGTH                          0x1
#define _SPI2INTF_SPI2RXOIF_MASK                            0x4
#define _SPI2INTF_SPI2EOSIF_POSN                            0x4
#define _SPI2INTF_SPI2EOSIF_POSITION                        0x4
#define _SPI2INTF_SPI2EOSIF_SIZE                            0x1
#define _SPI2INTF_SPI2EOSIF_LENGTH                          0x1
#define _SPI2INTF_SPI2EOSIF_MASK                            0x10
#define _SPI2INTF_SPI2SOSIF_POSN                            0x5
#define _SPI2INTF_SPI2SOSIF_POSITION                        0x5
#define _SPI2INTF_SPI2SOSIF_SIZE                            0x1
#define _SPI2INTF_SPI2SOSIF_LENGTH                          0x1
#define _SPI2INTF_SPI2SOSIF_MASK                            0x20
#define _SPI2INTF_SPI2TCZIF_POSN                            0x6
#define _SPI2INTF_SPI2TCZIF_POSITION                        0x6
#define _SPI2INTF_SPI2TCZIF_SIZE                            0x1
#define _SPI2INTF_SPI2TCZIF_LENGTH                          0x1
#define _SPI2INTF_SPI2TCZIF_MASK                            0x40
#define _SPI2INTF_SPI2SRMTIF_POSN                           0x7
#define _SPI2INTF_SPI2SRMTIF_POSITION                       0x7
#define _SPI2INTF_SPI2SRMTIF_SIZE                           0x1
#define _SPI2INTF_SPI2SRMTIF_LENGTH                         0x1
#define _SPI2INTF_SPI2SRMTIF_MASK                           0x80

// Register: SPI2INTE
#define SPI2INTE SPI2INTE
extern volatile unsigned char           SPI2INTE            __at(0x098);
#ifndef _LIB_BUILD
asm("SPI2INTE equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIE                  :1;
        unsigned RXOIE                  :1;
        unsigned                        :1;
        unsigned EOSIE                  :1;
        unsigned SOSIE                  :1;
        unsigned TCZIE                  :1;
        unsigned SRMTIE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI2TXUIE              :1;
        unsigned SPI2RXOIE              :1;
        unsigned                        :1;
        unsigned SPI2EOSIE              :1;
        unsigned SPI2SOSIE              :1;
        unsigned SPI2TCZIE              :1;
        unsigned SPI2SRMTIE             :1;
    };
} SPI2INTEbits_t;
extern volatile SPI2INTEbits_t SPI2INTEbits __at(0x098);
// bitfield macros
#define _SPI2INTE_TXUIE_POSN                                0x1
#define _SPI2INTE_TXUIE_POSITION                            0x1
#define _SPI2INTE_TXUIE_SIZE                                0x1
#define _SPI2INTE_TXUIE_LENGTH                              0x1
#define _SPI2INTE_TXUIE_MASK                                0x2
#define _SPI2INTE_RXOIE_POSN                                0x2
#define _SPI2INTE_RXOIE_POSITION                            0x2
#define _SPI2INTE_RXOIE_SIZE                                0x1
#define _SPI2INTE_RXOIE_LENGTH                              0x1
#define _SPI2INTE_RXOIE_MASK                                0x4
#define _SPI2INTE_EOSIE_POSN                                0x4
#define _SPI2INTE_EOSIE_POSITION                            0x4
#define _SPI2INTE_EOSIE_SIZE                                0x1
#define _SPI2INTE_EOSIE_LENGTH                              0x1
#define _SPI2INTE_EOSIE_MASK                                0x10
#define _SPI2INTE_SOSIE_POSN                                0x5
#define _SPI2INTE_SOSIE_POSITION                            0x5
#define _SPI2INTE_SOSIE_SIZE                                0x1
#define _SPI2INTE_SOSIE_LENGTH                              0x1
#define _SPI2INTE_SOSIE_MASK                                0x20
#define _SPI2INTE_TCZIE_POSN                                0x6
#define _SPI2INTE_TCZIE_POSITION                            0x6
#define _SPI2INTE_TCZIE_SIZE                                0x1
#define _SPI2INTE_TCZIE_LENGTH                              0x1
#define _SPI2INTE_TCZIE_MASK                                0x40
#define _SPI2INTE_SRMTIE_POSN                               0x7
#define _SPI2INTE_SRMTIE_POSITION                           0x7
#define _SPI2INTE_SRMTIE_SIZE                               0x1
#define _SPI2INTE_SRMTIE_LENGTH                             0x1
#define _SPI2INTE_SRMTIE_MASK                               0x80
#define _SPI2INTE_SPI2TXUIE_POSN                            0x1
#define _SPI2INTE_SPI2TXUIE_POSITION                        0x1
#define _SPI2INTE_SPI2TXUIE_SIZE                            0x1
#define _SPI2INTE_SPI2TXUIE_LENGTH                          0x1
#define _SPI2INTE_SPI2TXUIE_MASK                            0x2
#define _SPI2INTE_SPI2RXOIE_POSN                            0x2
#define _SPI2INTE_SPI2RXOIE_POSITION                        0x2
#define _SPI2INTE_SPI2RXOIE_SIZE                            0x1
#define _SPI2INTE_SPI2RXOIE_LENGTH                          0x1
#define _SPI2INTE_SPI2RXOIE_MASK                            0x4
#define _SPI2INTE_SPI2EOSIE_POSN                            0x4
#define _SPI2INTE_SPI2EOSIE_POSITION                        0x4
#define _SPI2INTE_SPI2EOSIE_SIZE                            0x1
#define _SPI2INTE_SPI2EOSIE_LENGTH                          0x1
#define _SPI2INTE_SPI2EOSIE_MASK                            0x10
#define _SPI2INTE_SPI2SOSIE_POSN                            0x5
#define _SPI2INTE_SPI2SOSIE_POSITION                        0x5
#define _SPI2INTE_SPI2SOSIE_SIZE                            0x1
#define _SPI2INTE_SPI2SOSIE_LENGTH                          0x1
#define _SPI2INTE_SPI2SOSIE_MASK                            0x20
#define _SPI2INTE_SPI2TCZIE_POSN                            0x6
#define _SPI2INTE_SPI2TCZIE_POSITION                        0x6
#define _SPI2INTE_SPI2TCZIE_SIZE                            0x1
#define _SPI2INTE_SPI2TCZIE_LENGTH                          0x1
#define _SPI2INTE_SPI2TCZIE_MASK                            0x40
#define _SPI2INTE_SPI2SRMTIE_POSN                           0x7
#define _SPI2INTE_SPI2SRMTIE_POSITION                       0x7
#define _SPI2INTE_SPI2SRMTIE_SIZE                           0x1
#define _SPI2INTE_SPI2SRMTIE_LENGTH                         0x1
#define _SPI2INTE_SPI2SRMTIE_MASK                           0x80

// Register: SPI2CLK
#define SPI2CLK SPI2CLK
extern volatile unsigned char           SPI2CLK             __at(0x099);
#ifndef _LIB_BUILD
asm("SPI2CLK equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKSEL                 :8;
    };
    struct {
        unsigned CLKSEL0                :1;
        unsigned CLKSEL1                :1;
        unsigned CLKSEL2                :1;
        unsigned CLKSEL3                :1;
    };
    struct {
        unsigned SPI2CLKSEL             :8;
    };
    struct {
        unsigned SPI2CLKSEL0            :1;
        unsigned SPI2CLKSEL1            :1;
        unsigned SPI2CLKSEL2            :1;
        unsigned SPI2CLKSEL3            :1;
    };
} SPI2CLKbits_t;
