GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.h
// Register: RC0I2C
#define RC0I2C RC0I2C
extern volatile unsigned char           RC0I2C              __at(0x289);
#ifndef _LIB_BUILD
asm("RC0I2C equ 0289h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC0I2Cbits_t;
extern volatile RC0I2Cbits_t RC0I2Cbits __at(0x289);
// bitfield macros
#define _RC0I2C_TH_POSN                                     0x0
#define _RC0I2C_TH_POSITION                                 0x0
#define _RC0I2C_TH_SIZE                                     0x2
#define _RC0I2C_TH_LENGTH                                   0x2
#define _RC0I2C_TH_MASK                                     0x3
#define _RC0I2C_PU_POSN                                     0x4
#define _RC0I2C_PU_POSITION                                 0x4
#define _RC0I2C_PU_SIZE                                     0x2
#define _RC0I2C_PU_LENGTH                                   0x2
#define _RC0I2C_PU_MASK                                     0x30
#define _RC0I2C_SLEW_POSN                                   0x6
#define _RC0I2C_SLEW_POSITION                               0x6
#define _RC0I2C_SLEW_SIZE                                   0x2
#define _RC0I2C_SLEW_LENGTH                                 0x2
#define _RC0I2C_SLEW_MASK                                   0xC0
#define _RC0I2C_TH0_POSN                                    0x0
#define _RC0I2C_TH0_POSITION                                0x0
#define _RC0I2C_TH0_SIZE                                    0x1
#define _RC0I2C_TH0_LENGTH                                  0x1
#define _RC0I2C_TH0_MASK                                    0x1
#define _RC0I2C_TH1_POSN                                    0x1
#define _RC0I2C_TH1_POSITION                                0x1
#define _RC0I2C_TH1_SIZE                                    0x1
#define _RC0I2C_TH1_LENGTH                                  0x1
#define _RC0I2C_TH1_MASK                                    0x2
#define _RC0I2C_PU0_POSN                                    0x4
#define _RC0I2C_PU0_POSITION                                0x4
#define _RC0I2C_PU0_SIZE                                    0x1
#define _RC0I2C_PU0_LENGTH                                  0x1
#define _RC0I2C_PU0_MASK                                    0x10
#define _RC0I2C_PU1_POSN                                    0x5
#define _RC0I2C_PU1_POSITION                                0x5
#define _RC0I2C_PU1_SIZE                                    0x1
#define _RC0I2C_PU1_LENGTH                                  0x1
#define _RC0I2C_PU1_MASK                                    0x20
#define _RC0I2C_SLEW0_POSN                                  0x6
#define _RC0I2C_SLEW0_POSITION                              0x6
#define _RC0I2C_SLEW0_SIZE                                  0x1
#define _RC0I2C_SLEW0_LENGTH                                0x1
#define _RC0I2C_SLEW0_MASK                                  0x40
#define _RC0I2C_SLEW1_POSN                                  0x7
#define _RC0I2C_SLEW1_POSITION                              0x7
#define _RC0I2C_SLEW1_SIZE                                  0x1
#define _RC0I2C_SLEW1_LENGTH                                0x1
#define _RC0I2C_SLEW1_MASK                                  0x80
#define _RC0I2C_I2CTH_POSN                                  0x0
#define _RC0I2C_I2CTH_POSITION                              0x0
#define _RC0I2C_I2CTH_SIZE                                  0x2
#define _RC0I2C_I2CTH_LENGTH                                0x2
#define _RC0I2C_I2CTH_MASK                                  0x3
#define _RC0I2C_I2CPU_POSN                                  0x4
#define _RC0I2C_I2CPU_POSITION                              0x4
#define _RC0I2C_I2CPU_SIZE                                  0x2
#define _RC0I2C_I2CPU_LENGTH                                0x2
#define _RC0I2C_I2CPU_MASK                                  0x30
#define _RC0I2C_I2CSLEW_POSN                                0x6
#define _RC0I2C_I2CSLEW_POSITION                            0x6
#define _RC0I2C_I2CSLEW_SIZE                                0x2
#define _RC0I2C_I2CSLEW_LENGTH                              0x2
#define _RC0I2C_I2CSLEW_MASK                                0xC0
#define _RC0I2C_I2CTH0_POSN                                 0x0
#define _RC0I2C_I2CTH0_POSITION                             0x0
#define _RC0I2C_I2CTH0_SIZE                                 0x1
#define _RC0I2C_I2CTH0_LENGTH                               0x1
#define _RC0I2C_I2CTH0_MASK                                 0x1
#define _RC0I2C_I2CTH1_POSN                                 0x1
#define _RC0I2C_I2CTH1_POSITION                             0x1
#define _RC0I2C_I2CTH1_SIZE                                 0x1
#define _RC0I2C_I2CTH1_LENGTH                               0x1
#define _RC0I2C_I2CTH1_MASK                                 0x2
#define _RC0I2C_I2CPU0_POSN                                 0x4
#define _RC0I2C_I2CPU0_POSITION                             0x4
#define _RC0I2C_I2CPU0_SIZE                                 0x1
#define _RC0I2C_I2CPU0_LENGTH                               0x1
#define _RC0I2C_I2CPU0_MASK                                 0x10
#define _RC0I2C_I2CPU1_POSN                                 0x5
#define _RC0I2C_I2CPU1_POSITION                             0x5
#define _RC0I2C_I2CPU1_SIZE                                 0x1
#define _RC0I2C_I2CPU1_LENGTH                               0x1
#define _RC0I2C_I2CPU1_MASK                                 0x20
#define _RC0I2C_I2CSLEW0_POSN                               0x6
#define _RC0I2C_I2CSLEW0_POSITION                           0x6
#define _RC0I2C_I2CSLEW0_SIZE                               0x1
#define _RC0I2C_I2CSLEW0_LENGTH                             0x1
#define _RC0I2C_I2CSLEW0_MASK                               0x40
#define _RC0I2C_I2CSLEW1_POSN                               0x7
#define _RC0I2C_I2CSLEW1_POSITION                           0x7
#define _RC0I2C_I2CSLEW1_SIZE                               0x1
#define _RC0I2C_I2CSLEW1_LENGTH                             0x1
#define _RC0I2C_I2CSLEW1_MASK                               0x80

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
extern volatile unsigned char           I2C1RXB             __at(0x28A);
#ifndef _LIB_BUILD
asm("I2C1RXB equ 028Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I2C1RXBbits_t;
extern volatile I2C1RXBbits_t I2C1RXBbits __at(0x28A);
// bitfield macros
#define _I2C1RXB_RXB_POSN                                   0x0
#define _I2C1RXB_RXB_POSITION                               0x0
#define _I2C1RXB_RXB_SIZE                                   0x8
#define _I2C1RXB_RXB_LENGTH                                 0x8
#define _I2C1RXB_RXB_MASK                                   0xFF

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
extern volatile unsigned char           I2C1TXB             __at(0x28B);
#ifndef _LIB_BUILD
asm("I2C1TXB equ 028Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I2C1TXBbits_t;
extern volatile I2C1TXBbits_t I2C1TXBbits __at(0x28B);
// bitfield macros
#define _I2C1TXB_TXB_POSN                                   0x0
#define _I2C1TXB_TXB_POSITION                               0x0
#define _I2C1TXB_TXB_SIZE                                   0x8
#define _I2C1TXB_TXB_LENGTH                                 0x8
#define _I2C1TXB_TXB_MASK                                   0xFF

// Register: I2C1CNTL
#define I2C1CNTL I2C1CNTL
extern volatile unsigned char           I2C1CNTL            __at(0x28C);
#ifndef _LIB_BUILD
asm("I2C1CNTL equ 028Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
} I2C1CNTLbits_t;
extern volatile I2C1CNTLbits_t I2C1CNTLbits __at(0x28C);
// bitfield macros
#define _I2C1CNTL_CNT_POSN                                  0x0
#define _I2C1CNTL_CNT_POSITION                              0x0
#define _I2C1CNTL_CNT_SIZE                                  0x8
#define _I2C1CNTL_CNT_LENGTH                                0x8
#define _I2C1CNTL_CNT_MASK                                  0xFF
#define _I2C1CNTL_CNT0_POSN                                 0x0
#define _I2C1CNTL_CNT0_POSITION                             0x0
#define _I2C1CNTL_CNT0_SIZE                                 0x1
#define _I2C1CNTL_CNT0_LENGTH                               0x1
#define _I2C1CNTL_CNT0_MASK                                 0x1
#define _I2C1CNTL_CNT1_POSN                                 0x1
#define _I2C1CNTL_CNT1_POSITION                             0x1
#define _I2C1CNTL_CNT1_SIZE                                 0x1
#define _I2C1CNTL_CNT1_LENGTH                               0x1
#define _I2C1CNTL_CNT1_MASK                                 0x2
#define _I2C1CNTL_CNT2_POSN                                 0x2
#define _I2C1CNTL_CNT2_POSITION                             0x2
#define _I2C1CNTL_CNT2_SIZE                                 0x1
#define _I2C1CNTL_CNT2_LENGTH                               0x1
#define _I2C1CNTL_CNT2_MASK                                 0x4
#define _I2C1CNTL_CNT3_POSN                                 0x3
#define _I2C1CNTL_CNT3_POSITION                             0x3
#define _I2C1CNTL_CNT3_SIZE                                 0x1
#define _I2C1CNTL_CNT3_LENGTH                               0x1
#define _I2C1CNTL_CNT3_MASK                                 0x8
#define _I2C1CNTL_CNT4_POSN                                 0x4
#define _I2C1CNTL_CNT4_POSITION                             0x4
#define _I2C1CNTL_CNT4_SIZE                                 0x1
#define _I2C1CNTL_CNT4_LENGTH                               0x1
#define _I2C1CNTL_CNT4_MASK                                 0x10
#define _I2C1CNTL_CNT5_POSN                                 0x5
#define _I2C1CNTL_CNT5_POSITION                             0x5
#define _I2C1CNTL_CNT5_SIZE                                 0x1
#define _I2C1CNTL_CNT5_LENGTH                               0x1
#define _I2C1CNTL_CNT5_MASK                                 0x20
#define _I2C1CNTL_CNT6_POSN                                 0x6
#define _I2C1CNTL_CNT6_POSITION                             0x6
#define _I2C1CNTL_CNT6_SIZE                                 0x1
#define _I2C1CNTL_CNT6_LENGTH                               0x1
#define _I2C1CNTL_CNT6_MASK                                 0x40
#define _I2C1CNTL_CNT7_POSN                                 0x7
#define _I2C1CNTL_CNT7_POSITION                             0x7
#define _I2C1CNTL_CNT7_SIZE                                 0x1
#define _I2C1CNTL_CNT7_LENGTH                               0x1
#define _I2C1CNTL_CNT7_MASK                                 0x80

// Register: I2C1CNTH
#define I2C1CNTH I2C1CNTH
extern volatile unsigned char           I2C1CNTH            __at(0x28D);
#ifndef _LIB_BUILD
asm("I2C1CNTH equ 028Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT8                   :1;
        unsigned CNT9                   :1;
        unsigned CNT10                  :1;
        unsigned CNT11                  :1;
        unsigned CNT12                  :1;
        unsigned CNT13                  :1;
        unsigned CNT14                  :1;
        unsigned CNT15                  :1;
    };
} I2C1CNTHbits_t;
