GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.h
// Register: I2C1BAUD
#define I2C1BAUD I2C1BAUD
extern volatile unsigned char           I2C1BAUD            __at(0x29D);
#ifndef _LIB_BUILD
asm("I2C1BAUD equ 029Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAUD                   :8;
    };
} I2C1BAUDbits_t;
extern volatile I2C1BAUDbits_t I2C1BAUDbits __at(0x29D);
// bitfield macros
#define _I2C1BAUD_BAUD_POSN                                 0x0
#define _I2C1BAUD_BAUD_POSITION                             0x0
#define _I2C1BAUD_BAUD_SIZE                                 0x8
#define _I2C1BAUD_BAUD_LENGTH                               0x8
#define _I2C1BAUD_BAUD_MASK                                 0xFF

// Register: I2C1CLK
#define I2C1CLK I2C1CLK
extern volatile unsigned char           I2C1CLK             __at(0x29E);
#ifndef _LIB_BUILD
asm("I2C1CLK equ 029Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned I2CCLK                 :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned I2CCLK0                :1;
        unsigned I2CCLK1                :1;
        unsigned I2CCLK2                :1;
        unsigned I2CCLK3                :1;
        unsigned I2CCLK4                :1;
    };
} I2C1CLKbits_t;
extern volatile I2C1CLKbits_t I2C1CLKbits __at(0x29E);
// bitfield macros
#define _I2C1CLK_CLK_POSN                                   0x0
#define _I2C1CLK_CLK_POSITION                               0x0
#define _I2C1CLK_CLK_SIZE                                   0x8
#define _I2C1CLK_CLK_LENGTH                                 0x8
#define _I2C1CLK_CLK_MASK                                   0xFF
#define _I2C1CLK_I2CCLK_POSN                                0x0
#define _I2C1CLK_I2CCLK_POSITION                            0x0
#define _I2C1CLK_I2CCLK_SIZE                                0x8
#define _I2C1CLK_I2CCLK_LENGTH                              0x8
#define _I2C1CLK_I2CCLK_MASK                                0xFF
#define _I2C1CLK_CLK0_POSN                                  0x0
#define _I2C1CLK_CLK0_POSITION                              0x0
#define _I2C1CLK_CLK0_SIZE                                  0x1
#define _I2C1CLK_CLK0_LENGTH                                0x1
#define _I2C1CLK_CLK0_MASK                                  0x1
#define _I2C1CLK_CLK1_POSN                                  0x1
#define _I2C1CLK_CLK1_POSITION                              0x1
#define _I2C1CLK_CLK1_SIZE                                  0x1
#define _I2C1CLK_CLK1_LENGTH                                0x1
#define _I2C1CLK_CLK1_MASK                                  0x2
#define _I2C1CLK_CLK2_POSN                                  0x2
#define _I2C1CLK_CLK2_POSITION                              0x2
#define _I2C1CLK_CLK2_SIZE                                  0x1
#define _I2C1CLK_CLK2_LENGTH                                0x1
#define _I2C1CLK_CLK2_MASK                                  0x4
#define _I2C1CLK_CLK3_POSN                                  0x3
#define _I2C1CLK_CLK3_POSITION                              0x3
#define _I2C1CLK_CLK3_SIZE                                  0x1
#define _I2C1CLK_CLK3_LENGTH                                0x1
#define _I2C1CLK_CLK3_MASK                                  0x8
#define _I2C1CLK_CLK4_POSN                                  0x4
#define _I2C1CLK_CLK4_POSITION                              0x4
#define _I2C1CLK_CLK4_SIZE                                  0x1
#define _I2C1CLK_CLK4_LENGTH                                0x1
#define _I2C1CLK_CLK4_MASK                                  0x10
#define _I2C1CLK_I2CCLK0_POSN                               0x0
#define _I2C1CLK_I2CCLK0_POSITION                           0x0
#define _I2C1CLK_I2CCLK0_SIZE                               0x1
#define _I2C1CLK_I2CCLK0_LENGTH                             0x1
#define _I2C1CLK_I2CCLK0_MASK                               0x1
#define _I2C1CLK_I2CCLK1_POSN                               0x1
#define _I2C1CLK_I2CCLK1_POSITION                           0x1
#define _I2C1CLK_I2CCLK1_SIZE                               0x1
#define _I2C1CLK_I2CCLK1_LENGTH                             0x1
#define _I2C1CLK_I2CCLK1_MASK                               0x2
#define _I2C1CLK_I2CCLK2_POSN                               0x2
#define _I2C1CLK_I2CCLK2_POSITION                           0x2
#define _I2C1CLK_I2CCLK2_SIZE                               0x1
#define _I2C1CLK_I2CCLK2_LENGTH                             0x1
#define _I2C1CLK_I2CCLK2_MASK                               0x4
#define _I2C1CLK_I2CCLK3_POSN                               0x3
#define _I2C1CLK_I2CCLK3_POSITION                           0x3
#define _I2C1CLK_I2CCLK3_SIZE                               0x1
#define _I2C1CLK_I2CCLK3_LENGTH                             0x1
#define _I2C1CLK_I2CCLK3_MASK                               0x8
#define _I2C1CLK_I2CCLK4_POSN                               0x4
#define _I2C1CLK_I2CCLK4_POSITION                           0x4
#define _I2C1CLK_I2CCLK4_SIZE                               0x1
#define _I2C1CLK_I2CCLK4_LENGTH                             0x1
#define _I2C1CLK_I2CCLK4_MASK                               0x10

// Register: I2C1BTOC
#define I2C1BTOC I2C1BTOC
extern volatile unsigned char           I2C1BTOC            __at(0x29F);
#ifndef _LIB_BUILD
asm("I2C1BTOC equ 029Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTOC                   :4;
    };
    struct {
        unsigned I2CBTOC                :4;
    };
    struct {
        unsigned BTOC0                  :1;
        unsigned BTOC1                  :1;
        unsigned BTOC2                  :1;
        unsigned BTOC3                  :1;
    };
    struct {
        unsigned I2CBTOC0               :1;
        unsigned I2CBTOC1               :1;
        unsigned I2CBTOC2               :1;
        unsigned I2CBTOC3               :1;
    };
} I2C1BTOCbits_t;
