GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.h
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x56C);	// @ (0xAD * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x56D);	// @ (0xAD * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x56E);	// @ (0xAD * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x57B);	// @ (0xAF * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// I2C1STAT0<NOT_A>
extern volatile __bit                   NOT_A               __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 NOT_A_bit           _BIT_ACCESS(I2C1STAT0,3)
// I2C1STAT0<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(I2C1STAT0,3)
// PCON0<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(PCON0,0)
// PCON1<NOT_MEMV>
extern volatile __bit                   NOT_MEMV            __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 NOT_MEMV_bit        _BIT_ACCESS(PCON1,1)
// PCON0<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(PCON0,1)
// PCON1<NOT_RCM>
extern volatile __bit                   NOT_RCM             __at(0x2788);	// @ (0x4F1 * 8 + 0)
#define                                 NOT_RCM_bit         _BIT_ACCESS(PCON1,0)
// PCON0<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 NOT_RI_bit          _BIT_ACCESS(PCON0,2)
// PCON0<NOT_RMCLR>
extern volatile __bit                   NOT_RMCLR           __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 NOT_RMCLR_bit       _BIT_ACCESS(PCON0,3)
// PCON1<NOT_RVREG>
extern volatile __bit                   NOT_RVREG           __at(0x278A);	// @ (0x4F1 * 8 + 2)
#define                                 NOT_RVREG_bit       _BIT_ACCESS(PCON1,2)
// PCON0<NOT_RWDT>
extern volatile __bit                   NOT_RWDT            __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 NOT_RWDT_bit        _BIT_ACCESS(PCON0,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x18AB);	// @ (0x315 * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x18A2);	// @ (0x314 * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x1933);	// @ (0x326 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x192A);	// @ (0x325 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// I2C1STAT0<NOT_W>
extern volatile __bit                   NOT_W               __at(0x14C4);	// @ (0x298 * 8 + 4)
#define                                 NOT_W_bit           _BIT_ACCESS(I2C1STAT0,4)
// PCON0<NOT_WDTWV>
extern volatile __bit                   NOT_WDTWV           __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 NOT_WDTWV_bit       _BIT_ACCESS(PCON0,5)
// I2C1STAT0<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x14C4);	// @ (0x298 * 8 + 4)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(I2C1STAT0,4)
// ADREF<NREF0>
extern volatile __bit                   NREF0               __at(0x1FC4);	// @ (0x3F8 * 8 + 4)
#define                                 NREF0_bit           _BIT_ACCESS(ADREF,4)
// ADREF<NREF1>
extern volatile __bit                   NREF1               __at(0x1FC5);	// @ (0x3F8 * 8 + 5)
#define                                 NREF1_bit           _BIT_ACCESS(ADREF,5)
// ADREF<NREF2>
extern volatile __bit                   NREF2               __at(0x1FC6);	// @ (0x3F8 * 8 + 6)
#define                                 NREF2_bit           _BIT_ACCESS(ADREF,6)
// ADREF<NREF3>
extern volatile __bit                   NREF3               __at(0x1FC7);	// @ (0x3F8 * 8 + 7)
#define                                 NREF3_bit           _BIT_ACCESS(ADREF,7)
// OPA1CON1<NSS1>
extern volatile __bit                   NSS1                __at(0x521);	// @ (0xA4 * 8 + 1)
#define                                 NSS1_bit            _BIT_ACCESS(OPA1CON1,1)
// OPA1CON1<NSS2>
extern volatile __bit                   NSS2                __at(0x522);	// @ (0xA4 * 8 + 2)
#define                                 NSS2_bit            _BIT_ACCESS(OPA1CON1,2)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x218);	// @ (0x43 * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x219);	// @ (0x43 * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0x222);	// @ (0x44 * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0x223);	// @ (0x44 * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0x224);	// @ (0x44 * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0x225);	// @ (0x44 * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0x226);	// @ (0x44 * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRH<NVMADR15>
extern volatile __bit                   NVMADR15            __at(0x227);	// @ (0x44 * 8 + 7)
#define                                 NVMADR15_bit        _BIT_ACCESS(NVMADRH,7)
// NVMADRU<NVMADR16>
extern volatile __bit                   NVMADR16            __at(0x228);	// @ (0x45 * 8 + 0)
#define                                 NVMADR16_bit        _BIT_ACCESS(NVMADRU,0)
// NVMADRU<NVMADR17>
extern volatile __bit                   NVMADR17            __at(0x229);	// @ (0x45 * 8 + 1)
#define                                 NVMADR17_bit        _BIT_ACCESS(NVMADRU,1)
// NVMADRU<NVMADR18>
extern volatile __bit                   NVMADR18            __at(0x22A);	// @ (0x45 * 8 + 2)
#define                                 NVMADR18_bit        _BIT_ACCESS(NVMADRU,2)
// NVMADRU<NVMADR19>
extern volatile __bit                   NVMADR19            __at(0x22B);	// @ (0x45 * 8 + 3)
#define                                 NVMADR19_bit        _BIT_ACCESS(NVMADRU,3)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x21A);	// @ (0x43 * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRU<NVMADR20>
extern volatile __bit                   NVMADR20            __at(0x22C);	// @ (0x45 * 8 + 4)
#define                                 NVMADR20_bit        _BIT_ACCESS(NVMADRU,4)
// NVMADRU<NVMADR21>
extern volatile __bit                   NVMADR21            __at(0x22D);	// @ (0x45 * 8 + 5)
#define                                 NVMADR21_bit        _BIT_ACCESS(NVMADRU,5)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x21B);	// @ (0x43 * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x21C);	// @ (0x43 * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x21D);	// @ (0x43 * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x21E);	// @ (0x43 * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x21F);	// @ (0x43 * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x220);	// @ (0x44 * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x221);	// @ (0x44 * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x230);	// @ (0x46 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x231);	// @ (0x46 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0x23A);	// @ (0x47 * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0x23B);	// @ (0x47 * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0x23C);	// @ (0x47 * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0x23D);	// @ (0x47 * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATH<NVMDAT14>
extern volatile __bit                   NVMDAT14            __at(0x23E);	// @ (0x47 * 8 + 6)
#define                                 NVMDAT14_bit        _BIT_ACCESS(NVMDATH,6)
// NVMDATH<NVMDAT15>
extern volatile __bit                   NVMDAT15            __at(0x23F);	// @ (0x47 * 8 + 7)
#define                                 NVMDAT15_bit        _BIT_ACCESS(NVMDATH,7)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x232);	// @ (0x46 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x233);	// @ (0x46 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x234);	// @ (0x46 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x235);	// @ (0x46 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x236);	// @ (0x46 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x237);	// @ (0x46 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0x238);	// @ (0x47 * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0x239);	// @ (0x47 * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// NVMCON0<NVMGO>
extern volatile __bit                   NVMGO               __at(0x200);	// @ (0x40 * 8 + 0)
#define                                 NVMGO_bit           _BIT_ACCESS(NVMCON0,0)
// PIE0<NVMIE>
extern volatile __bit                   NVMIE               __at(0x2544);	// @ (0x4A8 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE0,4)
// PIR0<NVMIF>
extern volatile __bit                   NVMIF               __at(0x259C);	// @ (0x4B3 * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR0,4)
// IPR0<NVMIP>
extern volatile __bit                   NVMIP               __at(0x1B3C);	// @ (0x367 * 8 + 4)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR0,4)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x2010);	// @ (0x402 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x2011);	// @ (0x402 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x2012);	// @ (0x402 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x2014);	// @ (0x402 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x2015);	// @ (0x402 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x2090);	// @ (0x412 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x2091);	// @ (0x412 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x2092);	// @ (0x412 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x2093);	// @ (0x412 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x2094);	// @ (0x412 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x2095);	// @ (0x412 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x3FC);	// @ (0x7F * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x3FD);	// @ (0x7F * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// OPA1OFFSET<OFFSET0>
extern volatile __bit                   OFFSET0             __at(0x540);	// @ (0xA8 * 8 + 0)
#define                                 OFFSET0_bit         _BIT_ACCESS(OPA1OFFSET,0)
// OPA1OFFSET<OFFSET1>
extern volatile __bit                   OFFSET1             __at(0x541);	// @ (0xA8 * 8 + 1)
#define                                 OFFSET1_bit         _BIT_ACCESS(OPA1OFFSET,1)
// OPA1OFFSET<OFFSET2>
extern volatile __bit                   OFFSET2             __at(0x542);	// @ (0xA8 * 8 + 2)
#define                                 OFFSET2_bit         _BIT_ACCESS(OPA1OFFSET,2)
// OPA1OFFSET<OFFSET3>
extern volatile __bit                   OFFSET3             __at(0x543);	// @ (0xA8 * 8 + 3)
#define                                 OFFSET3_bit         _BIT_ACCESS(OPA1OFFSET,3)
// OPA1OFFSET<OFFSET4>
extern volatile __bit                   OFFSET4             __at(0x544);	// @ (0xA8 * 8 + 4)
#define                                 OFFSET4_bit         _BIT_ACCESS(OPA1OFFSET,4)
// OPA1OFFSET<OFFSET5>
extern volatile __bit                   OFFSET5             __at(0x545);	// @ (0xA8 * 8 + 5)
#define                                 OFFSET5_bit         _BIT_ACCESS(OPA1OFFSET,5)
// OPA1OFFSET<OFFSET6>
extern volatile __bit                   OFFSET6             __at(0x546);	// @ (0xA8 * 8 + 6)
#define                                 OFFSET6_bit         _BIT_ACCESS(OPA1OFFSET,6)
// OPA1OFFSET<OFFSET7>
extern volatile __bit                   OFFSET7             __at(0x547);	// @ (0xA8 * 8 + 7)
#define                                 OFFSET7_bit         _BIT_ACCESS(OPA1OFFSET,7)
// OPA1CON0<OPA1CPON>
extern volatile __bit                   OPA1CPON            __at(0x51D);	// @ (0xA3 * 8 + 5)
#define                                 OPA1CPON_bit        _BIT_ACCESS(OPA1CON0,5)
// OPA1CON0<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x51F);	// @ (0xA3 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON0,7)
// OPA1CON3<OPA1FMS0>
extern volatile __bit                   OPA1FMS0            __at(0x536);	// @ (0xA6 * 8 + 6)
#define                                 OPA1FMS0_bit        _BIT_ACCESS(OPA1CON3,6)
// OPA1CON3<OPA1FMS1>
extern volatile __bit                   OPA1FMS1            __at(0x537);	// @ (0xA6 * 8 + 7)
#define                                 OPA1FMS1_bit        _BIT_ACCESS(OPA1CON3,7)
// OPA1CON1<OPA1GSEL0>
extern volatile __bit                   OPA1GSEL0           __at(0x524);	// @ (0xA4 * 8 + 4)
#define                                 OPA1GSEL0_bit       _BIT_ACCESS(OPA1CON1,4)
// OPA1CON1<OPA1GSEL1>
extern volatile __bit                   OPA1GSEL1           __at(0x525);	// @ (0xA4 * 8 + 5)
#define                                 OPA1GSEL1_bit       _BIT_ACCESS(OPA1CON1,5)
// OPA1CON1<OPA1GSEL2>
extern volatile __bit                   OPA1GSEL2           __at(0x526);	// @ (0xA4 * 8 + 6)
#define                                 OPA1GSEL2_bit       _BIT_ACCESS(OPA1CON1,6)
// OPA1HWC<OPA1HWCH0>
extern volatile __bit                   OPA1HWCH0           __at(0x53C);	// @ (0xA7 * 8 + 4)
#define                                 OPA1HWCH0_bit       _BIT_ACCESS(OPA1HWC,4)
// OPA1HWC<OPA1HWCH1>
extern volatile __bit                   OPA1HWCH1           __at(0x53D);	// @ (0xA7 * 8 + 5)
#define                                 OPA1HWCH1_bit       _BIT_ACCESS(OPA1HWC,5)
// OPA1HWC<OPA1HWCH2>
extern volatile __bit                   OPA1HWCH2           __at(0x53E);	// @ (0xA7 * 8 + 6)
#define                                 OPA1HWCH2_bit       _BIT_ACCESS(OPA1HWC,6)
// OPA1HWC<OPA1HWCL0>
extern volatile __bit                   OPA1HWCL0           __at(0x538);	// @ (0xA7 * 8 + 0)
#define                                 OPA1HWCL0_bit       _BIT_ACCESS(OPA1HWC,0)
// OPA1HWC<OPA1HWCL1>
extern volatile __bit                   OPA1HWCL1           __at(0x539);	// @ (0xA7 * 8 + 1)
#define                                 OPA1HWCL1_bit       _BIT_ACCESS(OPA1HWC,1)
// OPA1HWC<OPA1HWCL2>
extern volatile __bit                   OPA1HWCL2           __at(0x53A);	// @ (0xA7 * 8 + 2)
#define                                 OPA1HWCL2_bit       _BIT_ACCESS(OPA1HWC,2)
// OPA1CON2<OPA1NCH0>
extern volatile __bit                   OPA1NCH0            __at(0x52C);	// @ (0xA5 * 8 + 4)
#define                                 OPA1NCH0_bit        _BIT_ACCESS(OPA1CON2,4)
// OPA1CON2<OPA1NCH1>
extern volatile __bit                   OPA1NCH1            __at(0x52D);	// @ (0xA5 * 8 + 5)
#define                                 OPA1NCH1_bit        _BIT_ACCESS(OPA1CON2,5)
// OPA1CON2<OPA1NCH2>
extern volatile __bit                   OPA1NCH2            __at(0x52E);	// @ (0xA5 * 8 + 6)
#define                                 OPA1NCH2_bit        _BIT_ACCESS(OPA1CON2,6)
// OPA1CON1<OPA1NSS0>
extern volatile __bit                   OPA1NSS0            __at(0x520);	// @ (0xA4 * 8 + 0)
#define                                 OPA1NSS0_bit        _BIT_ACCESS(OPA1CON1,0)
// OPA1CON1<OPA1NSS1>
extern volatile __bit                   OPA1NSS1            __at(0x521);	// @ (0xA4 * 8 + 1)
#define                                 OPA1NSS1_bit        _BIT_ACCESS(OPA1CON1,1)
// OPA1CON1<OPA1NSS2>
extern volatile __bit                   OPA1NSS2            __at(0x522);	// @ (0xA4 * 8 + 2)
#define                                 OPA1NSS2_bit        _BIT_ACCESS(OPA1CON1,2)
// OPA1OFFSET<OPA1OFFSET0>
extern volatile __bit                   OPA1OFFSET0         __at(0x540);	// @ (0xA8 * 8 + 0)
#define                                 OPA1OFFSET0_bit     _BIT_ACCESS(OPA1OFFSET,0)
// OPA1OFFSET<OPA1OFFSET1>
extern volatile __bit                   OPA1OFFSET1         __at(0x541);	// @ (0xA8 * 8 + 1)
#define                                 OPA1OFFSET1_bit     _BIT_ACCESS(OPA1OFFSET,1)
// OPA1OFFSET<OPA1OFFSET2>
extern volatile __bit                   OPA1OFFSET2         __at(0x542);	// @ (0xA8 * 8 + 2)
#define                                 OPA1OFFSET2_bit     _BIT_ACCESS(OPA1OFFSET,2)
// OPA1OFFSET<OPA1OFFSET3>
extern volatile __bit                   OPA1OFFSET3         __at(0x543);	// @ (0xA8 * 8 + 3)
#define                                 OPA1OFFSET3_bit     _BIT_ACCESS(OPA1OFFSET,3)
// OPA1OFFSET<OPA1OFFSET4>
extern volatile __bit                   OPA1OFFSET4         __at(0x544);	// @ (0xA8 * 8 + 4)
#define                                 OPA1OFFSET4_bit     _BIT_ACCESS(OPA1OFFSET,4)
// OPA1OFFSET<OPA1OFFSET5>
extern volatile __bit                   OPA1OFFSET5         __at(0x545);	// @ (0xA8 * 8 + 5)
#define                                 OPA1OFFSET5_bit     _BIT_ACCESS(OPA1OFFSET,5)
// OPA1OFFSET<OPA1OFFSET6>
extern volatile __bit                   OPA1OFFSET6         __at(0x546);	// @ (0xA8 * 8 + 6)
#define                                 OPA1OFFSET6_bit     _BIT_ACCESS(OPA1OFFSET,6)
// OPA1OFFSET<OPA1OFFSET7>
extern volatile __bit                   OPA1OFFSET7         __at(0x547);	// @ (0xA8 * 8 + 7)
#define                                 OPA1OFFSET7_bit     _BIT_ACCESS(OPA1OFFSET,7)
// OPA1HWC<OPA1OREN>
extern volatile __bit                   OPA1OREN            __at(0x53F);	// @ (0xA7 * 8 + 7)
#define                                 OPA1OREN_bit        _BIT_ACCESS(OPA1HWC,7)
// OPA1HWC<OPA1ORPOL>
extern volatile __bit                   OPA1ORPOL           __at(0x53B);	// @ (0xA7 * 8 + 3)
#define                                 OPA1ORPOL_bit       _BIT_ACCESS(OPA1HWC,3)
// OPA1ORS<OPA1ORS0>
extern volatile __bit                   OPA1ORS0            __at(0x548);	// @ (0xA9 * 8 + 0)
#define                                 OPA1ORS0_bit        _BIT_ACCESS(OPA1ORS,0)
// OPA1ORS<OPA1ORS1>
extern volatile __bit                   OPA1ORS1            __at(0x549);	// @ (0xA9 * 8 + 1)
#define                                 OPA1ORS1_bit        _BIT_ACCESS(OPA1ORS,1)
// OPA1ORS<OPA1ORS2>
